10/data/attachments/1f57efcaf7aedc19.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Emily_although_Actions_39772_1</nif:username>
            <nif:friendToBeRequested>soap_actions_e466355c-ac6c-4c71-a4ff-8aeb04df75bd</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>